#!/bin/env python3
# -*- coding: utf-8 -*-
# version: Python3.X
"""
2017.02.13 题 10
    1. 计算平均值以及前移大于平均值的数
    2. 首字母大写转换
    3. 计算周边元素平均值
"""
__author__ = '__L1n__w@tch'


class Solve:
    @staticmethod
    def count_average_and_move_big(test_list):
        """
        给定一个列表
        任务一:
            计算平均值, 将平均值打印出来, 比如算出来的平均值为 30.5, 则打印出 30.5, 用字符串表示打印结果即为: "30.5\n"
        任务二:
            将大于平均值的数, 按照列表原来的顺序依次摆放到列表的前面;
            将小于等于平均值的数, 按照列表原来的顺序依次摆放的列表的后面
        具体例子:
            [46, 30, 32, 40, 6, 17, 45, 15, 48, 26]
            (1) 计算平均值, 得到 30.5
            (2) 依次观察每个元素, 大于平均值的数依次为: [46, 32, 40, 45, 48], 小于等于的依次为: [30, 6, 17, 15, 26]
                于是最终答案为: [46, 32, 40, 45, 48, 30, 6, 17, 15, 26]
        :param test_list: list(), 比如 [46, 30, 32, 40, 6, 17, 45, 15, 48, 26]
        :return: list(), 根据平均值移动数据后的列表, 比如 [46, 32, 40, 45, 48, 30, 6, 17, 15, 26] ; 平均值直接打印即可
        """
        pass

    @staticmethod
    def str_title():
        """
        从标准输入流读入一行英文文本, 每个英文单词以空格隔开, 比如
            "I am a student to take the examination"
        要求将其中每个单词的第一个字母改成大写, 然后返回此文本行, 比如
            "I Am A Student To Take The Examination"
        :return: str(), 转换首字母大写后的字符串, 比如 'I Am A Student To Take The Examination'
        """
        pass

    @staticmethod
    def count_margin_average(test_list):
        """
        给定一个 n*n 的矩阵, 此处固定为 3, 给例子为 n=5 的情况:
            [
                [0, 1, 2, 7, 9],
                [1, 9, 7, 4, 5],
                [2, 3, 8, 3, 1],
                [4, 5, 6, 8, 2],
                [5, 9, 1, 4, 1]
            ]
        要求计算矩阵周边元素的平均值, 并将平均值作为返回值返回
        如示例中, 周边元素即为 上: [0, 1, 2, 7, 9], 左: [1, 2, 4, 5], 右: [5, 1, 2, 1], 下: [9, 1, 4]
        :param test_list: list(), 矩阵, 此处固定为 3 维, 比如 [[171, 97, 207], [267, 969, 808], [908, 152, 519]]
        :return: int() or float(), 计算得到的平均值, 比如 391.125
        """
        pass


if __name__ == "__main__":
    pass
